export default {
  '{{number}} min read': '{number} мин. чтения',
  '{{year}} all rights reserved': '© {year}. Все права защищены.',

  'Blog Post': 'Блог пост',
  blog_post: 'Блог пост',
  'Content management': 'Управление контентом',
  error: {
    '403': {
      description: 'Похоже, у вас нет доступа к этой странице.',
      text: 'Нет доступа!',
    },
    '404': {
      description: 'Ой! Похоже, страница, которую вы ищете, исчезла без следа.',
      text: 'Страница не найдена!',
    },
    '500': {
      description: 'Похоже, на сервере произошла неожиданная ошибка.',
      text: 'Что-то пошло не так!',
    },
    bad_request: {
      description: 'Похоже, вы сделали ошибку в своем запросе.',
      text: 'Неверный запрос!',
    },
    field_is_required: {
      description: 'Это поле обязательно для заполнения',
      text: 'Поле обязательно для заполнения',
    },
    forbidden: {
      description: 'Похоже, у вас нет доступа к этой странице.',
      text: 'Нет доступа!',
    },
    invalid_access_token: {
      description: 'Похоже, ваш токен доступа недействителен.',
      text: 'Недействительный токен доступа!',
    },
    invalid_email: {
      description: 'Похоже, вы ввели неверный адрес электронной почты.',
      text: 'Неверный адрес электронной почты!',
    },
    not_found: {
      description: 'Ой! Похоже, страница, которую вы ищете, исчезла без следа.',
      text: 'Страница не найдена!',
    },
    unauthorized: {
      description: 'Похоже, у вас нет доступа к этой странице.',
      text: 'Нет доступа!',
    },
    unknown_error: {
      description: 'Похоже, на сервере произошла неожиданная ошибка.',
      text: 'Что-то пошло не так!',
    },
  },
  error_loading_data: 'Ошибка загрузки данных',

  error_page: {
    '404': {
      button_text: 'Вернуться на главную страницу.',
      subtitle:
        'Страница, которую вы ищете, не существует. Возможно, она была удалена, переименована или вы ввели неправильный адрес. Если вы считаете, что это ошибка, свяжитесь со службой поддержки.',
      title: 'Здесь ничего нет.',
    },
    '500': {
      button_text: 'Вернуться на главную страницу.',
      subtitle:
        'Произошла непредвиденная ошибка при обработке вашего запроса. Пожалуйста, попробуйте позже. Если проблема сохраняется — свяжитесь со службой поддержки.',
      title: 'Что-то пошло не так на нашей стороне.',
    },
  },

  home_page: {
    description:
      'Добро пожаловать в BitTrove — мой личный блог о программировании. Это не какой-то серьёзный проект (по крайней мере, пока), а скорее место, где я делюсь мыслями, идеями и экспериментами. Возможно, что-то окажется полезным, а что-то — просто отражением моего интереса к новым темам. BitTrove — это моя площадка для проб, исследований и небольших открытий.',
    title: 'Добро пожаловать в BitTrove — мой личный блог о программировании',
  },

  language: {
    all: 'Все',
    en: 'English',
    ru: 'Русский',
  },
  loading: 'Загрузка...',
  menu_items: {
    blog: {
      seoDescription: 'Страница блога',
      title: 'Блог',
    },
    cms: {
      title: 'CMS',
    },
    home: {
      seoDescription: 'Главная страница',
      title: 'Главная',
    },
    shards: {
      seoDescription: 'Страница фрагментов',
      title: 'Фрагменты',
    },
  },
  meta_general_description:
    'BitTrove — личный блог о программировании: код, инструменты и идеи. От React и MobX до DSL и архитектуры. Честные заметки разработчика',
  meta_general_keywords:
    'личный блог о программировании, блог про JavaScript, блог про React, статьи про MobX, советы по TypeScript, функциональное программирование, архитектура ПО, эксперименты с кодом, заметки разработчика, фронтенд разработка, блог веб-разработчика, effect-ts на практике, управление состоянием с RxJS, собственные редакторы на React	,',
  meta_title_suffix: 'BitTrove',
  no_results_found: 'Ничего не найдено',
  'Related Articles': 'Ещё по теме',
  'See all': 'Посмотреть все',
  Shard: 'Фрагмент',
  'Sort by:': 'Сортировать по:',
  search: {
    empty_message: 'Ничего не найдено. Попробуйте другой поисковый запрос.',
    empty_tip: 'Попробуйте поискать по другим ключевым словам или проверьте написание',
    empty_title: 'Результаты не найдены',
    placeholder: 'Поиск...',
    prompt_message: 'Введите минимум 3 символа для поиска',
    prompt_title: 'Поиск по контенту',
    search_close: 'Закрыть',
    search_navigation: 'Навигация',
    search_select: 'Выбрать',
    searching: 'Поиск...',
  },
  shard: 'Фрагмент',
  sort: {
    newest: 'Сначала новые',
    oldest: 'Сначала старые',
  },
  'Table of Contents': 'Содержание',
};
