export default {
  '{{number}} min read': '{number} мин. чтения',
  '{{year}} all rights reserved': '© {year}. Все права защищены.',
  'Content management': 'Управление контентом',
  error: {
    '403': {
      description: 'Похоже, у вас нет доступа к этой странице.',
      text: 'Нет доступа!',
    },
    '404': {
      description: 'Ой! Похоже, страница, которую вы ищете, исчезла без следа.',
      text: 'Страница не найдена!',
    },
    '500': {
      description: 'Похоже, на сервере произошла неожиданная ошибка.',
      text: 'Что-то пошло не так!',
    },
    bad_request: {
      description: 'Похоже, вы сделали ошибку в своем запросе.',
      text: 'Неверный запрос!',
    },
    field_is_required: {
      description: 'Это поле обязательно для заполнения',
      text: 'Поле обязательно для заполнения',
    },
    forbidden: {
      description: 'Похоже, у вас нет доступа к этой странице.',
      text: 'Нет доступа!',
    },
    invalid_access_token: {
      description: 'Похоже, ваш токен доступа недействителен.',
      text: 'Недействительный токен доступа!',
    },
    invalid_email: {
      description: 'Похоже, вы ввели неверный адрес электронной почты.',
      text: 'Неверный адрес электронной почты!',
    },
    not_found: {
      description: 'Ой! Похоже, страница, которую вы ищете, исчезла без следа.',
      text: 'Страница не найдена!',
    },
    unauthorized: {
      description: 'Похоже, у вас нет доступа к этой странице.',
      text: 'Нет доступа!',
    },
    unknown_error: {
      description: 'Похоже, на сервере произошла неожиданная ошибка.',
      text: 'Что-то пошло не так!',
    },
  },
  error_loading_data: 'Ошибка загрузки данных',

  error_page: {
    '404': {
      button_text: 'Вернуться на главную страницу.',
      subtitle:
        'Страница, которую вы ищете, не существует. Возможно, она была удалена, переименована или вы ввели неправильный адрес. Если вы считаете, что это ошибка, свяжитесь со службой поддержки.',
      title: 'Здесь ничего нет.',
    },
    '500': {
      button_text: 'Вернуться на главную страницу.',
      subtitle:
        'Произошла непредвиденная ошибка при обработке вашего запроса. Пожалуйста, попробуйте позже. Если проблема сохраняется — свяжитесь со службой поддержки.',
      title: 'Что-то пошло не так на нашей стороне.',
    },
  },

  language: {
    all: 'Все',
    en: 'English',
    ru: 'Русский',
  },
  loading: 'Загрузка...',
  menu_items: {
    blog: {
      seoDescription: 'Страница блога',
      title: 'Блог',
    },
    cms: {
      title: 'CMS',
    },
    home: {
      seoDescription: 'Главная страница',
      title: 'Главная',
    },
    shards: {
      seoDescription: 'Страница фрагментов',
      title: 'Фрагменты',
    },
  },
  meta_general_description:
    'BitTrove — личный блог о программировании: код, инструменты и идеи. От React и MobX до DSL и архитектуры. Честные заметки разработчика',
  meta_general_keywords:
    'личный блог о программировании, блог про JavaScript, блог про React, статьи про MobX, советы по TypeScript, функциональное программирование, архитектура ПО, эксперименты с кодом, заметки разработчика, фронтенд разработка, блог веб-разработчика, effect-ts на практике, управление состоянием с RxJS, собственные редакторы на React	,',
  meta_title_suffix: 'BitTrove',
  no_results_found: 'Ничего не найдено',
  'See all': 'Посмотреть все',
  search: {
    placeholder: 'Поиск',
  },
};
